{"translation-revision-date":"2025-10-30 22:53:25+0000","generator":"GlotPress\/4.0.3","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n != 1;","lang":"es_MX"},"If local pickup is enabled, the \"Hide shipping costs until an address is entered\" setting will be ignored.":["Si la recogida local está habilitada, se ignorará el ajuste \"Ocultar los gastos de envío hasta que se introduzca una dirección\"."],"Add pickup location":["Agregar lugar de recolección"],"When you add a pickup location, it will appear here.":["Cuando añade una ubicación de recolección, aparecerá aquí."],"Define pickup locations for your customers to choose from during checkout.":["Defina ubicaciones de recolección para que sus clientes elijan durante el checkout."],"Pickup locations":["Ubicaciones de recolección"],"Delete location":["Borrar ubicación"],"Edit pickup location":["Editar ubicación de recolección"],"Pickup details":["Detalles de recolección"],"A Location title is required":["El título de recolección es requerido"],"Location name":["Nombre de ubicación"],"Not taxable":["No sujeto a impuestos"],"By default, the local pickup shipping method is free.":["Por defecto, el método de entrega tipo recolección es gratuito."],"Add a price for customers who choose local pickup":["Agregue un precio para los clientes que elijan recolección local"],"Local pickup title is required":["El título de recolección local es requerido"],"This is the shipping method title shown to customers.":["Este es el título del método de envío que se muestra a los clientes."],"When enabled, local pickup will appear as an option on the block based checkout.":["Cuando está activo, la recogida local a parecerá como opción en el pago basado en bloques."],"View checkout page":["Ver página de finalizar compra"],"Enable or disable local pickup on your store, and define costs. Local pickup is only available from the block checkout.":["Activa o desactiva la recogida local en tu tienda, y define los costes. La recogida local solo está disponible en el pago mediante bloques."],"Local Pickup settings have been saved.":["Los ajustes de recogida local se han guardado."],"Optional cost to charge for local pickup.":["Costo opcional a cargar para la recogida local."],"If a cost is defined, this controls if taxes are applied to that cost.":["Si se define un costo, esto controla si se aplican las tarifas a ese costo."],"Pickup location":["Ubicación de recogida"],"Done":["Hecho"],"Country \/ State":["País \/ Estado"],"Title":["Título"],"Enable local pickup":["Habilitar recogida local"],"Postcode \/ ZIP":["Código postal"],"Save changes":["Guardar los cambios"],"Free":["Gratis"],"Enabled":["Activado"],"Cost":["Coste"],"Learn more":["Aprende más"],"Taxable":["Imponible"],"Address":["Dirección","Direcciones"],"Cancel":["Cancelar"],"City":["Ciudad"],"Taxes":["Impuestos"],"State":["Estado"],"Edit":["Editar"]}},"comment":{"reference":"assets\/client\/blocks\/wc-shipping-method-pickup-location.js"}}